
{
    "Weapons": [
      {"Name": "Attack Boost", "Desc": "Increases attack power.","Lv1":"Attack +3","Lv2":"Attack +5","Lv3":"Attack +7","Lv4":"Attack +2% Bonus: +8","Lv5":"Attack +4% Bonus: +9"},
      {"Name": "Offensive Guard", "Desc": "Temporarily increases attack power after executing a perfectly-timed guard.","Lv1":"Attack +5% while active.","Lv2":"Attack +10% while active.","Lv3":"Attack +15% while active."},
      {"Name": "Critical Eye", "Desc": "Increases affinity.","Lv1":"Affinity +4%","Lv2":"Affinity +8%","Lv3":"Affinity +12%","Lv4":"Affinity +16%","Lv5":"Affinity +20%"},
      {"Name": "Critical Boost", "Desc": "Increases the damage of critical hits.","Lv1":"Increases damage dealt by critical hits to 28%.","Lv2":"Increases damage dealt by critical hits to 31%.","Lv3":"Increases damage dealt by critical hits to 34%.","Lv4":"Increases damage dealt by critical hits to 37%.","Lv5":"Increases damage dealt by critical hits to 40%."},
      {"Name": "Critical Draw", "Desc": "Increases affinity when performing draw attacks. (Not effective while riding.)","Lv1":"Affinity +50%","Lv2":"Affinity +75%","Lv3":"Affinity +100%"},
      {"Name": "Fire Attack", "Desc": "Increases fire element attack power. (Elemental attack power has a maximum limit.)","Lv1":"Fire attack +40","Lv2":"Fire attack +10% Bonus: +50","Lv3":"Fire attack +20% Bonus: +60"},
      {"Name": "Water Attack", "Desc": "Increases water element attack power. (Elemental attack power has a maximum limit.)","Lv1":"Water attack +40","Lv2":"Water attack +10% Bonus: +50","Lv3":"Water attack +20% Bonus: +60"},
      {"Name": "Ice Attack", "Desc": "Increases ice element attack power. (Elemental attack power has a maximum limit.)","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Thunder Attack", "Desc": "Increases thunder element attack power. (Elemental attack power has a maximum limit.)","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Dragon Attack", "Desc": "Increases dragon element attack power. (Elemental attack power has a maximum limit.)","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Poison Attack", "Desc": "Increases the rate of poison buildup. (Poison buildup has a maximum limit.)","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Paralysis Attack", "Desc": "Increases the rate of paralysis buildup. (Paralysis buildup has a maximum limit.)","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Sleep Attack", "Desc": "Increases the rate of sleep buildup. (Sleep buildup has a maximum limit.)","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Blast Attack", "Desc": "Increases the rate of blast buildup. (Blast buildup has a maximum limit.)","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Critical Element", "Desc": "Increases elemental damage (fire, water, thunder, ice, dragon) when landing critical hits.","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Critical Status", "Desc": "Increases abnormal status effects (paralysis, poison, sleep, blast) when landing critical hits.","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Charge Master", "Desc": "Increases element power and status buildup for charged attacks.","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Handicraft", "Desc": "Extends the weapon sharpness gauge. However, it will not increase the gauge past its maximum.","Lv1":"XXXX","Lv2":"XXXX","Lv3":"XXXX","Lv4":"XXXX","Lv5":"XXXX"},
      {"Name": "Razor Sharp", "Desc": "Prevents your weapon from losing sharpness."},
      {"Name": "Protective Polish", "Desc": "Weapon sharpness does not decrease for a set time after sharpening."},
      {"Name": "Mind's Eye", "Desc": "Your attacks are deflected less and deal more damage to hard targets."},
      {"Name": "Bludgeoner", "Desc": "Increases attack power when your weapon sharpness is low."},
      {"Name": "Master's Touch", "Desc": "Prevents your weapon from losing sharpness during critical hits."},
      {"Name": "Normal Shots", "Desc": "Increases the attack power of Normal Ammo, normal arrows, and Flying Swallow Shot."},
      {"Name": "Piercing Shots", "Desc": "Increases the attack of the bowgun's Pierce Ammo, and the bow's Dragon Piercer and Thousand Dragons."},
      {"Name": "Spread/Power Shots", "Desc": "Increases the attack of the bowgun's Spread Ammo and the bow's Power Shots and Quick Shots."},
      {"Name": "Ballistics", "Desc": "Extends the range in which ammo and arrows have maximum power."},
      {"Name": "Rapid Fire Up", "Desc": "Improves light bowgun rapid fire."},
      {"Name": "Opening Shot", "Desc": "Increases the bowgun's reload speed and increases the power of bullets when fully loaded."},
      {"Name": "Tetrad Shot", "Desc": "Increases affinity of bowgun ammo/ coatings from the fourth shot and attack of the fourth and sixth shots."},
      {"Name": "Special Ammo Boost", "Desc": "Increases the power of the bowgun's special ammo, and the bow's Dragon Piercer, Thousand Dragons, and Tracer."},
      {"Name": "Poison Functionality", "Desc": "Allows you to apply poison coatings."},
      {"Name": "Para Functionality", "Desc": "Allows you to apply paralysis coatings."},
      {"Name": "Sleep Functionality", "Desc": "Allows you to apply sleep coatings."},
      {"Name": "Blast Functionality", "Desc": "Allows you to apply blast coatings."},
      {"Name": "Exhaust Functionality", "Desc": "Allows you to apply exhaust coatings."},
      {"Name": "Focus", "Desc": "Increases the fill rate for weapons with gauges and the charge rate for weapons with charge attacks."},
      {"Name": "Power Prolonger", "Desc": "Allows long swords, dual blades, insect glaives, switch axes, and charge blades to stay powered up longer."},
      {"Name": "Punishing Draw", "Desc": "Adds a stun effect to draw attacks and slightly increases attack power. (Not effective while riding.)"},
      {"Name": "Slugger", "Desc": "Makes it easier to stun monsters."},
      {"Name": "Stamina Thief", "Desc": "Increases certain attacks' ability to exhaust monsters."},
      {"Name": "Artillery", "Desc": "Strengthens explosive attacks like shells, Wyvern's Fire, charge blade phial attacks, and Sticky Ammo."},
      {"Name": "Rapid Morph", "Desc": "Increases switch speed and power for switch axes and charge blades."},
      {"Name": "Horn Maestro", "Desc": "Increases the effect duration of hunting horn melodies. (Effect lost when you change weapons.)"},
      {"Name": "Charge Up", "Desc": "Increases your power to induce stun when you hit a monster with a hammer's charged attack."},
      {"Name": "Airborne", "Desc": "Increases the damage caused by jumping attacks."},
      {"Name": "Poison Duration Up", "Desc": "Extends the duration of your poison's effect on monsters."},
      {"Name": "Guard", "Desc": "Reduces knockbacks and stamina depletion when guarding."},
      {"Name": "Guard Up", "Desc": "Allows you to guard against ordinarily unblockable attacks."},
      {"Name": "Load Shells", "Desc": "Improves reloading, and increases the gunlance's shell capacity and charge blade's phial capacity."},
      {"Name": "Speed Sharpening", "Desc": "Speeds up weapon sharpening when using a whetstone."},
      {"Name": "Slicked Blade", "Desc": "Temporarily increases affinity when wet or when inflicted with bubbleblight. (Wet and bubbleblight effects stack.)"},
      {"Name": "Whiteflame Torrent", "Desc": "Chance to deal additional damage after landing an attack."}
    ],
    "Equip": {
      "Resentment": "Increases attack when you have recoverable damage (the red portion of your Health Gauge).",
      "Adrenaline Rush": "Temporarily increases attack power after executing a perfectly-timed evade just as a monster attacks.",
      "Peak Performance": "Increases attack when your health is full.",
      "Counterstrike": "Temporarily increases attack power after being knocked back.",
      "Weakness Exploit": "Increases the affinity of attacks that exploit a monster's weak points and wounds.",
      "Maximum Might": "Increases affinity if stamina is kept full for a period of time.",
      "Convert Element": "After taking elemental damage, temporarily grants you dragon element effects. (Cooldown after effect ends.)",
      "Defense Boost": "Increases defense. Also improves resistances at higher levels.",
      "Divine Blessing": "Has a predetermined chance of reducing the damage you take.",
      "Fire Resistance": "Increases fire resistance. Also improves defense at higher levels.",
      "Water Resistance": "Increases water resistance. Also improves defense at higher levels.",
      "Thunder Resistance": "Increases thunder resistance. Also improves defense at higher levels.",
      "Ice Resistance": "Increases ice resistance. Also improves defense at higher levels.",
      "Dragon Resistance": "Increases dragon resistance. Also improves defense at higher levels.",
      "Poison Resistance": "Reduces damage while poisoned.",
      "Paralysis Resistance": "Reduces the duration of paralysis.",
      "Sleep Resistance": "Reduces the duration of sleep.",
      "Iron Skin": "Grants protection against defense down.",
      "Blight Resistance": "Grants protection against all elemental blights.",
      "Stun Resistance": "Reduces the duration of stun.",
      "Bleeding Resistance": "Grants protection against bleeding.",
      "Bind Resistance": "Grants protection against webbed status and frostblight.",
      "Blast Resistance": "Grants protection against blastblight.",
      "Stench Resistance": "Grants protection against stench.",
      "Adaptability": "Grants protection against environmental damage, such as from heat or cold.",
      "Recovery Up": "Increases the amount recovered when restoring health.",
      "Recovery Speed": "Speeds healing of recoverable damage (the red portion of the Health Gauge).",
      "Survival Expert": "Extra health is recovered from environmental interactables.",
      "Constitution": "Reduces stamina depletion when evading, blocking, or doing certain other actions.",
      "Stamina Surge": "Speeds up stamina recovery.",
      "Marathon Runner": "Slows down stamina depletion for actions that continuously drain stamina (such as dashing).",
      "Hunger Resistance": "Reduces maximum stamina depletion over time.",
      "Agitator": "Increases attack power and affinity when large monsters become enraged.",
      "Latent Power": "Temporarily increases affinity and reduces stamina depletion when certain conditions are met.",
      "Heroics": "Increases attack power and defense when health drops to 35% or lower.",
      "Burst": "Continuously landing hits gradually increases attack and elemental attack. (Amount increased depends on weapon.)",
      "Foray": "Increases attack power and affinity against large monsters affected by poison or paralysis.",
      "Flayer": "Makes it easier to inflict wounds. Upon inflicting enough damage, also deals additional non-elemental damage.",
      "Palico Rally": "Powers up Palicoes.",
      "Partbreaker": "Makes it easier to break large monster parts, and increases damage dealt when destroying a wound with a Focus Strike.",
      "Coalescence": "Temporarily increases elemental attack power and status effects after recovering from blights or abnormal status.",
      "Ambush": "Temporarily increases damage to large monsters with a successful Sneak Attack.",
      "Antivirus": "Once infected, makes it easier to overcome the Frenzy and increases affinity if cured.",
      "Elemental Absorption": "After taking elemental damage, temporarily grants you element effects. (Cooldown after effect ends)",
      "Self-Improvement": "Attack and defense increase as time passes while on a quest. (The maximum is reached after 30 minutes.)",
      "Evade Window": "Extends the invulnerability period when evading.",
      "Evade Extender": "Increases evade distance.",
      "Earplugs": "Grants protection from large monsters' roars.",
      "Quick Sheathe": "Speeds up weapon sheathing.",
      "Windproof": "Grants protection against wind pressure.",
      "Tremor Resistance": "Grants protection against ground tremors.",
      "Flinch Free": "Prevents knockbacks and other reactions to small damage.",
      "Intimidator": "Reduces the chance small monsters will attack after spotting you. (Has no effect on certain monsters.)",
      "Speed Eating": "Increases meat-eating and item-consumption speed.",
      "Aquatic/Oilsilt Mobility": "Grants resistance against impairments to mobility while in water, oilsilt, or streams.",
      "Shock Absorber": "Disables damage reactions when you hit a friend or when a friend hits you.",
      "Leap of Faith": "Allows you to do a dive-evade when facing towards large monsters and extends the dive-evade distance.",
      "Jump Master": "Prevents attacks from knocking you back during a jump.",
      "Cliffhanger": "Decreases stamina depletion when climbing on vines.",
      "Wide-Range": "Allows the effects of certain items to also affect nearby allies.",
      "Tool Specialist": "Reduces the recharge time for specialized tools.",
      "Bombardier": "Increases the damage of explosive items.",
      "Mushroomancer": "Lets you digest mushrooms that would otherwise be inedible and gain their advantageous effects.",
      "Item Prolonger": "Extends the duration of some item effects.",
      "Free Meal": "Gives you a predetermined chance of consuming a food or drink item for free.",
      "Blindsider": "Improves the effectiveness of flash attacks and items.",
      "Botanist": "Increases the quantity of herbs and other consumable items you gather.",
      "Geologist": "Increases the number of items you gain at gathering points.",
      "Entomologist": "The bodies of small insect monsters won't be destroyed, allowing them to be carved.",
      "Outdoorsman": "Improves fishing, grilling, and transporting abilities."
    }
  }
  